package base.operators.operator.nlp.fasttext;

import java.util.ArrayList;
import java.util.List;
import java.util.concurrent.TimeoutException;

public class FastTest {

	public static void main(String[] args) throws TimeoutException {
		List<String> value = new ArrayList<String>();
		value.add(
				"英 相 发表 对印 计划 仍 无意 予 印度独立 【 新 华社 延安 二十日 电 】 伦敦 讯 : 英 首相 艾德 永 , 在下 院 发表 英 内阁 赴 印 使团 关于 解决 印度问题 的 计划 , 其 要点 如下 : 一 、 成立 印度联邦 , 包括 英属印度 和 各 王公 统治 的 藩邦 , 联邦 的 权力范围 限于 交通 、 外交 、 国防 及 向人民 征集 财政 等 。 二 、 联邦 设 行政 及 立法 机关 , 由 英属 英印 和 各 藩邦 代表 组成 , 在 议会 中发生 种族 间 重大 争执 问题 时 , 需 有 到 会议员 的 及 国 回 两 党均 同意 才能 决定 。 三 、 不 属于 联邦 的 一切 其他 权力 , 仍 属于 英属印度 各省 。 四 、 藩邦 除 让与 联邦 的 权力 外 , 保留 其他 一切 权力 。 五 、 各省 可 自由 结成 省 联 集团 。 六 、 每隔 十年 , 各省 可以 其 议会 多数 的 表决 , 要求 重新 考虑 宪法 的 各 条款 。 关于 联邦 立宪议会 的 组成 , 该 计划 以 势将 使 议会 的 成立 延期 为 借口 , 主张 不 举行 成年人 普选 , 而 以 目前 的 省议会 作为 选举 机关 。 以 各省 人口 的 比例 , 推出 联邦 议员 。 计划 又 决定 不答应 印度 回教徒 成立 自治国 的 要求 , 该 计划 最后 建议 英印 保持 密切联系 。 __label__国际关系#");
		value.add("英军 留恋 伊朗 石油 迄今 未 自 巴林岛 撤退 【 新 华社 延安 二十八日 电 】 德黑兰 讯 : 伊朗 阿 什 塔 报 要求 政府 派 调查团 至 伊朗 南部 , 调查 英军 是否 确已 自 该地 撤退 。 该报 又 称 : 英 军 迄今 未 自 伊朗 的 巴林岛 撤退 ( 位于 波斯湾 , 系 石油产地 ) , 这种 行动 , 安理会 为什么 没有 提出 任何 讨论 呢 ? 【 新 华社 延安 二十八日 电 】 开罗 讯 : 由于 埃及 当局 对 英方 的 计划 发生 异议 、 英 埃 谈判 已 陷 停顿 。 英 代表 已 返 英 , 向 外相 贝文 请示 。 据悉 : 埃及 拒绝 在 英 埃 条约 中 , 规定 “ 在 战争威胁 下 ” , “ 英 军 得 重 新开 入 埃及 ” 。 __label__国际关系# \n 朝鲜人民 拥 戴政 府 土地改革 已 告 完成 农民 得到 近 百万 公顷 土地 【 新 华社 延安 三十一日 电 】 汉城 讯 : 在 普遍平等 投票 基础上 选出 的 朝鲜北部 人民自治 政府 , 已 日益 生长 与 巩固 起来 , 并 已 获得 朝鲜 扩大 人民 的 拥护 。 鲜 北 政权 之 中央机构 , 为 鲜 北 临时 人民 委员会 , 在 本年 二月 九日 各 民主党派 、 公共 团体 、 省 和 区 人民 委员会 的 代表大会 上 建立 的 。 会上 全体 一致 选举 民族解放运动 的 英雄 金 贻 荪 为 政府 主席 , 金 德邦 为 副主席 。 大会 还 拟出 了 紧急措施 纲领 , 土地改革 , 恢复 工业 、 运输业 , 改组 教育 系统 , 向人民 解释 莫斯科外长会议 关于 朝鲜 的 决定 为 “ 最 公正 并 符合 于 朝鲜人民 切身利益 的 ” 。 纲领 中 还 敦促 坚决 清除 亲日分子 等 。 临时 人民委员会 数日 来 , 在 执行 这个 纲领 上 , 已有 了 很大 进展 。 该 委员会 已 采取 许多 措施 , 以 恢复 经济 和 改善 人民 之 生活 , 大 工厂 与 矿山 都 已 开工 , 许多 中小企业 已开始 工作 。 依据 工人 熟练 程度 和 生产 各部门 之 差异 , 建立 了 合理 的 粮食配给 与 工资标准 , 并 实行 了 八小时工作制 。 学校 、 司法 及 其他 民主改革 , 正 进行 中 。 土地改革 已完成 , 使 无地农民 及 贫农 得到 了 九十 六 万三千 六百 五 十七 公顷 土地 。 在 许多 城市 的 农民 大会 上 , 农民 在 发言 中 都 高兴 地 流 着 眼泪 说 : “ 我们 相信 红军 来 了 , 就 会 把 土地 交还 其 真正 的 主人 ” 。 他们 并 感谢 代表人民利益 的 人民委员会 。 __label__国际关系#");
//		ClassifierImpl kw = new ClassifierImpl();
//
//		Map<String,String> result = kw.trainFastModel(value);
//		System.out.println(result.get("result"));
//		System.out.println(result.get("fileName"));
//		System.out.println(result.get("filePath"));
	}
}
